const hiraganaIndex = [
	"あ",
	"あち",
	"い",
	"いつかう",
	"うつか",
	"おうは",
	"おやち",
	"かい",
	"かたと",
	"かん",
	"きさは",
	"きよ",
	"くえ",
	"けい",
	"けん",
	"こう",
	"このこ",
	"さうら",
	"さんお",
	"し",
	"しつひ",
	"しゆ",
	"しよ",
	"しよう",
	"すあ",
	"せい",
	"せんあ",
	"そのき",
	"たかも",
	"たん",
	"ちよ",
	"て",
	"とい",
	"ともこ",
	"に",
	"のりと",
	"はつか",
	"ひこ",
	"ふ",
	"へい",
	"ほう",
	"まは",
	"めい",
	"やくふ",
	"よく",
	"りよく",
	"わける",
];

const katakanaIndex = [
	"ア",
	"アチ",
	"イウ",
	"イフ",
	"ウン",
	"オク",
	"オン",
	"カウ",
	"カチ",
	"キ",
	"キチ",
	"キヨウ",
	"クチ",
	"ケウ",
	"コ",
	"コキ",
	"コフ",
	"サク",
	"シ",
	"シイ",
	"シフ",
	"シユウ",
	"シヨウ",
	"シヨク",
	"スイ",
	"セウ",
	"ソ",
	"ソン",
	"タク",
	"チ",
	"チヨク",
	"テ",
	"トウ",
	"トル",
	"ニク",
	"ハ",
	"ハン",
	"ヒツ",
	"フウ",
	"ヘイ",
	"ホク",
	"マン",
	"メウ",
	"ユ",
	"ラ",
	"リヨク",
];


const bushuIndex = {
// 画数ブレーク 1画
	"一": [
		10,
		"一",
		"一七下三上",
		"上万千与不",
		"不",
		"不且世丕正百",
	],
	"丨": [
		14,
		"中",
	],
	"丶": [
		14,
		"凡丹主水",
	],
	"丿": [
		14,
		"乃",
		"乃〆九久屯乎乍乖",
	],
	"乙": [
		15,
		"乙九乞",
	],
	"亅": [
		15,
		"了",
		"了予争事",
	],
// 画数ブレーク 2画
	"二": [
		16,
		"二于云",
		"云五井夫",
	],
	"亠": [
		17,
		"亢六玄亦交充京卒亭哀",
		"哀畜衰高率棄稟敲浦褒羸",
	],
	"人《亻》": [
		18,
		"人个化仇今什从仍",
		"仍仁仏以仡仕",
		"仕囚仙他代付令𡭗伊仮",
		"仮会企伎件仰伉仲伝任伐状",
		"［人偏に弖］合全何",
		"何伽佐作伺似侘但体",
		"低佃侫伴余伶攸依佳供使侍",
		"侍侏侘佩侮併例命念俄係俟信促俗便",
		"便保俤叙倚倭倶候借倡倩値倒俳倍倣倫倉修",
		"修偕偽偶偈健偖側偸停偏",
		"偏倏備傅傍僅傾催傷僉僧傭僂像僕億儀僻",
		"僻儅儘儕儚償優儲儵儻",
	],
	"儿": [
		29,
		"兀元兄充先",
		"先兆克児兎免兜",
	],
	"入": [
		30,
		"入内",
	],
	"八": [
		30,
		"八",
		"八公兵其典兼翼興",
	],
	"冂": [
		31,
		"内円冊同岡罔",
	],
	"冖": [
		31,
		"冝",
		"冠冤冥",
	],
	"冫": [
		32,
		"次况冷况凋凍凌凝",
	],
	"几": [
		32,
		"几凡",
	],
	"凵": [
		32,
		"出凸画",
	],
	"刀《刂》": [
		33,
		"刁切分召刎列删刟判別利劫刻刷刺剋前則剰副",
		"副割劇",
	],
	"力": [
		34,
		"加劬努励労効勅勉勘",
		"勘動務勒勤募勧勢勠",
	],
	"勹": [
		35,
		"勾勿旬",
		"匍訇",
	],
	"匕": [
		36,
		"化北",
	],
	"匚": [
		36,
		"区匹［匚に口］巨匡医匪匭匱",
	],
	"十": [
		36,
		"十千升半協阜南卑博",
		"博準",
	],
	"卜": [
		37,
		"卜",
	],
	"卩《⺋》": [
		37,
		"却即巵",
	],
	"厂": [
		37,
		"仄灰厚辱厭歴厲",
	],
	"厶": [
		37,
		"允去台弁牟参",
		"参",
	],
	"又": [
		38,
		"又叉双反友収取叛叡",
	],
// 画数ブレーク 3画
	"口": [
		38,
		"口可",
		"可叶古只台叨［匚に口］右吉吃向后合吊吐各听呉吹呵咎呪",
		"呪周咄和亟哀咽咸哉哆咲員哭唆啓啄啖唯啐㗻喫喬喧喤啻善喩鳴嗟嗜",
		"嗔嗷器嘱嘶噉嘲嘸噯噫嚮嚼囀囉",
	],
	"囗": [
		41,
		"囚四因回団囲困",
		"困図固国園",
	],
	"土": [
		42,
		"土在圬地坎均坐垂",
		"垣垢城埒執埜堆堂堪堅塔塒塞塗境増壊壟",
	],
	"士": [
		43,
		"士吉壮売喜",
		"嘉",
	],
	"夂": [
		44,
		"処変",
	],
	"夕": [
		44,
		"夕外名多夥",
	],
	"大": [
		44,
		"大",
		"大太天夫失",
		"夾奄奇奈奉奔奪",
	],
	"女": [
		46,
		"奴如",
		"如好妄妨妖委姑妻始威姧要娯媒",
		"媒媚媸嫉嫡嬉",
	],
	"子": [
		48,
		"子孔孕存孰",
	],
	"宀": [
		48,
		"字安宇守完牢宛官宜",
		"宜実定客宣宥家",
		"家害宸容案寄宿密寇寔寒塞寛",
		"寛寡寤察寧審褰賽",
	],
	"寸": [
		51,
		"寸対専尅射将尋尊",
	],
	"小《⺌》": [
		51,
		"小",
		"小少尖当尚嘗爾",
	],
	"尤": [
		52,
		"尤",
		"尤尫就",
	],
	"⺍": [
		53,
		"栄営厳",
	],
	"尸": [
		53,
		"尸尺尻尽尾居",
		"居屈咫屋屑展属屢",
	],
	"屮": [
		54,
		"屯",
	],
	"山": [
		54,
		"山出",
		"出屹岐岨峙峨峻豈崇凱崱嶮巍巘",
	],
	"川": [
		55,
		"川花",
	],
	"艹": [
		55,
		"芝芳若",
		"若芥苅苦前苛苟荒苴草首荷華茲荐莞著莫",
		"莫莅菟募萎菅落墓葭葛慕暮蓋蓍蒙蔵蔑蓬蔀蕩蕳薫薄",
		"薬薨﨟薩藪蘓",
	],
	"工": [
		58,
		"工巧左巫差",
		"差",
	],
	"己": [
		59,
		"巳己巷巻",
	],
	"巾": [
		59,
		"巾布吊希帯帰帷幄帽幟幢幡幣",
	],
	"干": [
		59,
		"干",
		"平年罕并",
	],
	"幺": [
		60,
		"幼幽幾",
	],
	"广": [
		60,
		"広庁庄",
		"序床応度庫座庶鹿廉麾廩靡麞鷹",
	],
	"廴": [
		61,
		"延",
		"延廻廼",
	],
	"廾": [
		62,
		"弁弊",
	],
	"弋": [
		62,
		"弑",
	],
	"弓": [
		62,
		"弓引弘",
		"弘弗弦弥弱強張",
	],
	"彑": [
		63,
		"彙",
	],
	"彡": [
		63,
		"形彫須影",
	],
	"彳": [
		63,
		"彳",
		"役往径彼後待従徐徒",
		"徒徙得卸徧微",
		"微",
	],
// 画数ブレーク 4画
	"心《忄》": [
		66,
		"心必忙応忌忍怡怪怙惚忽忩忝",
		"念怖忿怺悔恪急恟恒恰思恃恤怠恚恁",
		"恁恩恐恭悃恣悚息悩悸恙惟悪患悉",
		"悉情悴惜惆惘惶愀惣悲愛意慍感愧愚",
		"愚愆慊愁想愍愈慇慳愳愬慥態慟慓慕慢慰慙",
		"憚憤憐懐懈憖憑懇懦懸",
	],
	"手《扌》": [
		71,
		"才手",
		"手打払扒扣扱扨抂抉抄抓",
		"択投把扶抃抔抑折押拠",
		"拘承拙抽抵拝披抱抛拉按括挟挂挍拶指",
		"持拵挑挊挙捆挿捌捕掩掛掲捷推接排掠援揮揆掌提揖",
		"携搆搦摂損摧摺［手偏にしんにょうと囬］摭撮撰撤撓播撥撫擒撿擬擎擯攄攀攘攪",
	],
	"水《氵》": [
		76,
		"水",
		"水氷汗江汐求決沙汰沈沐没沃河況泫沽",
		"沽泝治注泥泛法海洄活洽洒浅洞",
		"派浣涓浩消浹浮浦流浪浤涾液淵淹涯混渋渉深清済淡添淮温",
		"減渾滋湿測湛渺満溝滞滂溜漬漸漲滴滌漂漫漁潰澆潺潛潤潜潦激濃濡濘濫",
		"濫瀝灌灑",
	],
	"犭": [
		81,
		"犯狐狎狭狩独狷狼猜猖猶猥獄",
		"獲",
	],
	"⻏《邑》": [
		82,
		"那都部",
	],
	"阝《阜》": [
		82,
		"阡阜阿附除陣陰陳陪陸",
		"陸陵随階陽隘隔隙隠際障",
	],
	"戈": [
		83,
		"戈戎成我戒或哉",
		"載截戯戮跋",
	],
	"戸": [
		84,
		"扈",
	],
	"支": [
		84,
		"支翅攲",
	],
	"攵": [
		84,
		"攸放故政敏致敖赦敢敬散数",
		"数敲敷整",
	],
	"文": [
		85,
		"文吝対",
	],
	"斗": [
		85,
		"斗料斟",
	],
	"斤": [
		85,
		"所",
		"所欣断斯新",
	],
	"方": [
		86,
		"方放",
		"放於施旁旌族旋",
	],
	"无": [
		87,
		"无既",
	],
	"日《曰》": [
		87,
		"日",
		"日曰旦旧旨早曳曲",
		"曲旱更易昏昔昉明者昵春是星昼",
		"曷晏晒時書晦晨最暁晩普",
		"普曾替量暗暍暇暉暖暮暫",
		"暫暴曜曠曝曩",
	],
	"月《肉》": [
		92,
		"月有育",
		"育肴胡胎背胖朔朗胸脇脂能脣脱勝",
		"勝期朝腋腰膝膩［謄の言が貝］",
	],
	"木": [
		94,
		"木本未朽条杣来杳枉",
		"杻松東杪架枯柵柿某相案格校栖彬梟検森棟",
		"棟渠楽業極楯概構榼様榑模横権樋標機檜櫂鬱",
	],
	"欠": [
		96,
		"欠",
		"欠欣欵欲歇歓歎歟",
	],
	"止": [
		97,
		"止正此歩",
		"歩歴齢齧",
	],
	"歹": [
		98,
		"列夙殆殃残殊殖殫",
	],
	"殳": [
		98,
		"殺毀",
	],
	"毋": [
		98,
		"母",
		"毎",
	],
	"比": [
		99,
		"比",
	],
	"毛": [
		99,
		"毬",
	],
	"气": [
		99,
		"気",
	],
	"火《灬》": [
		99,
		"火打灸災炎炙炊炒炬炷炳",
		"為点烟焉烽焼然",
		"然無",
		"無煙照煖煨煩熨熟黙熾燃燎燬燥",
	],
	"爪《爫》": [
		102,
		"孚受采󠄁爰",
		"爰愛",
	],
	"父": [
		103,
		"父",
	],
	"爿《丬》": [
		103,
		"壮将",
	],
	"片": [
		103,
		"片版牓",
	],
	"牛《牜》": [
		103,
		"牛牟物牲牽犇犂",
	],
	"王": [
		103,
		"玉",
		"弄玳珍望理瑕瑞聖瑣",
	],
	"耂": [
		104,
		"老者",
	],
	"辶": [
		104,
		"辷辺巡辻近迎返述迫迚",
		"迦逆退迨追逃迴迹造速逐通逓透迸連逸",
		"這逍進逮逶運過遂遅道遍遊遥遏",
		"遏違遠遣遑遄遉遁逼遖遮適蓬遺遵",
		"遷還遶避𨗈邂遽邏［しんにょうに蘘］",
	],
// 画数ブレーク 5画
	"玄": [
		108,
		"玄畜率",
	],
	"瓦": [
		108,
		"甄甃甑",
	],
	"甘": [
		108,
		"甘甚",
		"甚",
	],
	"生": [
		109,
		"生産",
	],
	"用": [
		109,
		"用甫",
	],
	"田": [
		109,
		"甲申田由町果畏畜",
		"留異畢略累畳番疇",
	],
	"疋": [
		110,
		"疋疎楚疑",
	],
	"疒": [
		110,
		"疫疵疾痛瘞癈療癱",
	],
	"癶": [
		111,
		"発登",
	],
	"白": [
		111,
		"白皂的泉皆習皓",
	],
	"皿": [
		111,
		"盈益",
		"盍盗盖盟監盪",
	],
	"目": [
		112,
		"目具直",
		"直看相省眄県眤真眥眦眼眷",
		"眷着睨睡督瞋瞳瞬瞻矍",
	],
	"罒《网》": [
		114,
		"罕罵罷羅",
	],
	"矛": [
		114,
		"矜",
	],
	"矢": [
		114,
		"矢矣知矧短矯",
	],
	"石": [
		114,
		"石研砌",
		"破［石偏に戈2つ］磁確磔磐礑礭",
	],
	"示《礻》": [
		115,
		"礼社祇祝神祐祠祗禍禁",
		"禁禅福禦禰",
	],
	"禾": [
		116,
		"利私禿和委",
		"委季秉科秋称秣秘移稀稍",
		"程稚稠稟種稼穏稽",
	],
	"穴": [
		118,
		"穴究空窃",
		"穿窂窕窘",
	],
	"立": [
		119,
		"立章竟竪竭端競",
	],
	"歹《歺》": [
		119,
		"斃",
	],
// 画数ブレーク 6画
	"衣《衤》": [
		119,
		"衣初表衾袒袙被",
		"被袷裁補褂裳褊襁",
	],
	"竹": [
		120,
		"ケ笈笏笑笆笧笘筓策等答筆節箇",
		"管算箭築籌籠",
	],
	"米": [
		121,
		"米料粉粗精糴",
	],
	"糸": [
		121,
		"糸糺",
		"糺紆索純素納紕紛経細紮紫絁終",
		"終絆累絬給結絮絶統継続維綺緇緒総綻綯綸縁緩",
		"緩緘縡縦繁繆縮［糸偏に寄］繞繚繋繰纏纔",
	],
	"羊": [
		125,
		"美羞群羡",
	],
	"羽": [
		125,
		"羽翅翎翔翫翻",
	],
	"而": [
		125,
		"而",
	],
	"耒": [
		125,
		"耒耘耦",
	],
	"耳": [
		125,
		"耳",
		"耳声取耶耽聊聚聢聳聴職",
	],
	"自": [
		126,
		"自",
		"自",
	],
	"至": [
		127,
		"至與",
	],
	"臼": [
		127,
		"舁舂興",
	],
	"舌": [
		127,
		"乱舐甜",
	],
	"舛": [
		127,
		"舞",
	],
	"舟": [
		127,
		"舫艀",
	],
	"艮": [
		127,
		"良",
		"良",
	],
	"色": [
		128,
		"色艶",
	],
	"虍": [
		128,
		"處虎虚虞慮虧",
	],
	"虫": [
		128,
		"蚤蚕蜑蟠蠢蠡蠲",
	],
	"血": [
		128,
		"血衄衆",
	],
	"行": [
		128,
		"行",
		"行術街衝衛",
	],
	"覀《西》": [
		129,
		"覃",
	],
// 画数ブレーク 7画
	"見": [
		129,
		"見規覚",
		"覚覘親覩靦覿",
	],
	"角": [
		130,
		"角斛觜解触觴",
	],
	"言": [
		130,
		"言",
		"言計訇訖訕討設訛許訪訳",
		"詞診訴詈詰詳誠誅誂誉誨誑誓説認誣誘課諸請諍諾",
		"誕談調諂誹諒論謂諧諫諡諦諷謀謹謙謚謗謫謬謾譏警",
		"識議譲譬譴讚讒",
	],
	"豆": [
		134,
		"豈豎",
	],
	"豕": [
		134,
		"象",
	],
	"豸": [
		134,
		"貌",
	],
	"貝": [
		134,
		"則負員財貨貫",
		"責貪販貧貽貴貯買費貶資賃賄賑賛賤質賠賦賢賭賽賺贄贏贐贔",
	],
	"赤": [
		135,
		"［まげあしに赤］赦赫",
	],
	"走": [
		135,
		"走",
		"起越趍趣",
	],
	"足": [
		136,
		"足距跉跪跟跡践跣路跼踈踊踏蹂踶踰",
		"蹉蹐蹈蹋蹔蹤蹲躁躍躓",
	],
	"身": [
		137,
		"身躮躰［身偏に花］躵軈",
	],
	"車": [
		137,
		"転軟軼軻軽較載軾輔輙",
		"輙輩輦輸轅轡",
	],
	"辛": [
		138,
		"辨辞",
	],
	"酉": [
		138,
		"酣酷醒［酉偏に僕の旁］醲醴",
	],
	"釆": [
		138,
		"釈",
	],
	"里": [
		138,
		"重野量",
	],
// 画数ブレーク 8画
	"長": [
		138,
		"長",
		"長",
	],
	"金": [
		139,
		"金針釣鈍鉤鉏鉄銓鉾［金偏に侵󠄁の旁］鋪錯錘鍬鍍鎰鎖鎮鏤鐚",
	],
	"門": [
		139,
		"門鬥問開間",
		"間閑閙聞閣関閲閫閭閼閾鬨闇闋䦨",
		"闕闔闘闡䦰",
	],
	"隹": [
		141,
		"雙售雀集雄雅截雑雖",
		"雖雛難",
	],
	"雨": [
		142,
		"雨雩雪零震霊霑霤露霹霽",
	],
	"青": [
		142,
		"青静",
	],
	"非": [
		142,
		"非",
		"非輩",
	],
// 画数ブレーク 9画
	"面": [
		143,
		"面",
	],
	"革": [
		143,
		"勒鞦鞢",
	],
	"音": [
		143,
		"音頃",
	],
	"頁": [
		143,
		"須",
		"須順頓煩頒頗領頤頼",
		"頭頻額顕類願顛顧顰",
	],
	"風": [
		145,
		"風颪飆",
	],
	"飛": [
		145,
		"飛",
	],
	"食": [
		145,
		"餘食飲餁餓饑饒饗",
	],
	"香": [
		145,
		"香馥",
	],
// 画数ブレーク 10画
	"馬": [
		145,
		"馴馳",
		"馳駆駈駐駭験騒驕驥",
	],
	"髟": [
		146,
		"髣髻",
	],
	"鬼": [
		146,
		"嵬魂魑",
	],
// 画数ブレーク 11画
	"魚": [
		146,
		"魚鮮鮥鯨鯢鰥",
	],
	"鳥": [
		146,
		"烏鳥鳳鵝鶴",
	],
	"鹵": [
		146,
		"鹵",
	],
	"鹿": [
		146,
		"麁",
		"麁麗",
	],
	"麥《麦》": [
		147,
		"麴",
	],
	"黒": [
		147,
		"點黒默黠黷",
	],
// 画数ブレーク 12画
	"黹": [
		147,
		"黻",
	],
// 画数ブレーク 13画
	"鼓": [
		147,
		"鼓",
	],
// 画数ブレーク 14画
	"斉": [
		147,
		"斉斎",
	],
	"龍": [
		147,
		"龓",
	],
	"亀": [
		147,
		"亀",
	]
};

const summary = [
	["序", 4],
	["編集例言／凡例", 6],
	["依拠・参考文献", 7],
	["監修・異体字揮毫・編集", 9],
	["古文書・古記録頻出異体字一覧", 149],
	["奥付", 207],
];



